Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/strict-mode_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: strict-mode title: Strict Mode permalink: docs/strict-mode.html ---
ja: --- id: strict-mode title: strict モード permalink: docs/strict-mode.html ---

source: `StrictMode` is a tool for highlighting potential problems in an application.
ja: `StrictMode` はアプリケーションの潜在的な問題点を洗い出すためのツールです。

source: Like `Fragment`, `StrictMode` does not render any visible UI.
ja: `Fragment` と同様に、`StrictMode` は目に見える UI を描画しません。

source: It activates additional checks and warnings for its descendants.
ja: `StrictMode` の子孫要素に対しては、付加的な検査および警告が動くようになります。

source: > Note: > > Strict mode checks are run in development mode only; _they do not impact the production build_.
ja: > 補足： > > strict モードでの検査は開発モードでのみ動きます。_本番ビルドには影響を与えません_。

source: You can enable strict mode for any part of your application.
ja: strict モードはアプリケーションの任意の箇所で有効にできます。下はその一例です。

source: For example: `embed:strict-mode/enabling-strict-mode.js`
ja: `embed:strict-mode/enabling-strict-mode.js`

source: In the above example, strict mode checks will *not* be run against the `Header` and `Footer` components.
ja: 上のコード例において、`Header` と `Footer` に対しては strict モードの検査は*されません*。

source: However, `ComponentOne` and `ComponentTwo`, as well as all of their descendants, will have the checks.
ja: しかし `ComponentOne`、`ComponentTwo` およびそのすべての子孫要素に対しては検査が働きます。現在、`StrictMode` は以下のことに役立ちます。

source: `StrictMode` currently helps with: * [Identifying components with unsafe lifecycles](#identifying-unsafe-lifecycles) * [Warning about legacy string ref API usage](#warning-about-legacy-string-ref-api-usage) * [Warning about deprecated findDOMNode usage](#warning-about-deprecated-finddomnode-usage) * [Detecting unexpected side effects](#detecting-unexpected-side-effects) * [Detecting legacy context API](#detecting-legacy-context-api)
ja: * [安全でないライフサイクルの特定](#identifying-unsafe-lifecycles) * [レガシーな文字列 ref API の使用に対する警告](#warning-about-legacy-string-ref-api-usage) * [非推奨な findDOMNode の使用に対する警告](#warning-about-deprecated-finddomnode-usage) * [意図しない副作用の検出](#detecting-unexpected-side-effects) * [レガシーなコンテクスト API の検出](#detecting-legacy-context-api)

source: Additional functionality will be added with future releases of React.
ja: 将来の React のリリースではこの他にも機能が追加される予定です。

source: ### Identifying unsafe lifecycles {#identifying-unsafe-lifecycles}
ja: ### 安全でないライフサイクルの特定 {#identifying-unsafe-lifecycles}

source: As explained [in this blog post](/blog/2018/03/27/update-on-async-rendering.html), certain legacy lifecycle methods are unsafe for use in async React applications.
ja: [このブログ記事](/blog/2018/03/27/update-on-async-rendering.html)で書かれているように、いくつかのライフサイクルメソッドは非同期な React アプリケーションで使用するにあたって安全ではありません。

source: However, if your application uses third party libraries, it can be difficult to ensure that these lifecycles aren't being used.
ja: しかしながら、アプリケーションがサードパーティのライブラリを用いているなら、そのような安全でないライフサイクルが使用されていないと保証することは難しくなります。

source: Fortunately, strict mode can help with this!
ja: strict モードは、幸運にもこのような場合に役立ちます！

source: When strict mode is enabled, React compiles a list of all class components using the unsafe lifecycles, and logs a warning message with information about these components, like so:
ja: strict モードが有効のとき、React は安全でないライフサイクルを使用した全てのクラス型コンポーネントのリストをまとめあげ、それらのコンポーネントの情報を含む下のような警告のログを出力します。

source: Addressing the issues identified by strict mode _now_ will make it easier for you to take advantage of concurrent rendering in future releases of React.
ja: _今_ strict モードによって特定された問題に対処しておくことで、将来の React のリリース時に、並行レンダリングを活用しやすくなります。

source: ### Warning about legacy string ref API usage {#warning-about-legacy-string-ref-api-usage}
ja: ### レガシーな文字列 ref API の使用に対する警告 {#warning-about-legacy-string-ref-api-usage}

source: Previously, React provided two ways for managing refs: the legacy string ref API and the callback API.
ja: 以前は、React は ref を管理するためにレガシーな文字列 ref API とコールバック API の 2 つの手法を提供していました。

source: Although the string ref API was the more convenient of the two, it had [several downsides](https://github.com/facebook/react/issues/1373) and so our official recommendation was to [use the callback form instead](/docs/refs-and-the-dom.html#legacy-api-string-refs).
ja: 文字列 ref API はより便利なものでしたが、[いくつか不都合な点](https://github.com/facebook/react/issues/1373)があり、公式に[コールバック形式を代わりに用いること](/docs/refs-and-the-dom.html#legacy-api-string-refs)を推奨しました。

source: React 16.3 added a third option that offers the convenience of a string ref without any of the downsides: `embed:16-3-release-blog-post/create-ref-example.js`
ja: React 16.3 ではこれらの不都合なく文字列 ref の利点を活かせるような次の第 3 の選択を追加しました。`embed:16-3-release-blog-post/create-ref-example.js`

source: Since object refs were largely added as a replacement for string refs, strict mode now warns about usage of string refs.
ja: オブジェクトによる ref は文字列 ref を置きかえるため主に追加されたため、現在 strict モードでは文字列 ref の使用に対して警告します。

source: > **Note:** > > Callback refs will continue to be supported in addition to the new `createRef` API.
ja: > **補足：** > > コールバックによる ref は新しい `createRef` API に加えて継続してサポートされます。

source: > > You don't need to replace callback refs in your components.
ja: > > コンポーネント内のコールバックによる ref を置きかえる必要はありません。

source: They are slightly more flexible, so they will remain as an advanced feature.
ja: コールバック ref は少しだけ柔軟に使えるため、発展的な機能として残り続けます。

source: [Learn more about the new `createRef` API here.](/docs/refs-and-the-dom.html)
ja: [新しい `createRef` API についてはこちらを参照してください。](/docs/refs-and-the-dom.html)

source: ### Warning about deprecated findDOMNode usage {#warning-about-deprecated-finddomnode-usage}
ja: ### 非推奨な findDOMNode の使用に対する警告 {#warning-about-deprecated-finddomnode-usage}

source: React used to support `findDOMNode` to search the tree for a DOM node given a class instance.
ja: React ではかつてクラスのインスタンスを元にツリー内の DOM ノードを見つける `findDOMNode` がサポートされていました。

source: Normally you don't need this because you can [attach a ref directly to a DOM node](/docs/refs-and-the-dom.html#creating-refs).
ja: 通常、[DOM ノードに ref を付与する](/docs/refs-and-the-dom.html#creating-refs)ことができるため、このような操作は必要ありません。

source: `findDOMNode` can also be used on class components but this was breaking abstraction levels by allowing a parent to demand that certain children were rendered.
ja: `findDOMNode` はクラスコンポーネントでも使用可能でしたが、これによって親要素が特定の子要素がレンダーされるのを要求する状況が許されてしまい、抽象レベルを破壊してしまっていました。

source: It creates a refactoring hazard where you can't change the implementation details of a component because a parent might be reaching into its DOM node.
ja: このことにより、親要素が子の DOM ノードにまで踏み込んでしまう可能性があるためにコンポーネントの詳細な実装を変更できない、というようなリファクタリングの危険要因を生み出してしまっていました。

source: `findDOMNode` only returns the first child, but with the use of Fragments, it is possible for a component to render multiple DOM nodes.
ja: `findDOMNode` は 1 番目の子要素しか返しませんが、フラグメントを使うことによりコンポーネントは複数の DOM ノードをレンダーできます。

source: `findDOMNode` is a one time read API. It only gave you an answer when you asked for it.
ja: 更に `findDOMNode` はその場限りの読みこみ API であり、問い合わせたときにしか結果を返しません。

source: If a child component renders a different node, there is no way to handle this change.
ja: もし子コンポーネントが別のノードをレンダーした場合に、この変化を捕捉することはできません。

source: Therefore `findDOMNode` only worked if components always return a single DOM node that never changes.
ja: これらのため、`findDOMNode` はコンポーネントが絶対に変化することのない単一の DOM ノードのみを返す場合のみ有効なものでした。

source: You can instead make this explicit by passing a ref to your custom component and pass that along to the DOM using [ref forwarding](/docs/forwarding-refs.html#forwarding-refs-to-dom-components).
ja: 代わりに [ref のフォワーディング](/docs/forwarding-refs.html#forwarding-refs-to-dom-components)を使うことで、カスタムコンポーネントに ref を渡し、DOM にまで引き継ぐことでこれを明示的にすることができます。

source: You can also add a wrapper DOM node in your component and attach a ref directly to it.
ja: コンポーネントのラッパーの DOM ノードを追加し、そこに直接 ref を付与することもできます。

source: > Note: > > In CSS, the [`display: contents`](https://developer.mozilla.org/en-US/docs/Web/CSS/display#display_contents) attribute can be used if you don't want the node to be part of the layout.
ja: > 補足： > > CSS では、特定のノードをレイアウトの一部にしたくない場合 [`display: contents`](https://developer.mozilla.org/en-US/docs/Web/CSS/display#display_contents) 属性が利用できます。

source: ### Detecting unexpected side effects {#detecting-unexpected-side-effects}
ja: ### 意図しない副作用の検出 {#detecting-unexpected-side-effects}

source: Conceptually, React does work in two phases: * The **render** phase determines what changes need to be made to e.g. the DOM. During this phase, React calls `render` and then compares the result to the previous render.
ja: 概念的に、React は次の 2 つのフェーズで動作します。* **レンダー**フェーズでは、変更対象（例えば DOM）にどのような変更が必要か決めます。

source: * The **commit** phase is when React applies any changes.
ja: このフェーズにおいて、React は `render` を呼び出し、1 つ前のレンダー結果と比較します。

source: (In the case of React DOM, this is when React inserts, updates, and removes DOM nodes.) React also calls lifecycles like `componentDidMount` and `componentDidUpdate` during this phase.
ja: * **コミット**フェーズで React は変更を反映します（React DOM の場合ではここで React は DOM ノードの挿入、更新、削除を行います）。React はこのフェーズで `componentDidMount` や `componentDidUpdate` などのライフサイクルの呼び出しも行います。

source: The commit phase is usually very fast, but rendering can be slow.
ja: コミットフェーズは大体の場合非常に高速ですが、レンダーは低速になることがあります。

source: For this reason, the upcoming concurrent mode (which is not enabled by default yet) breaks the rendering work into pieces, pausing and resuming the work to avoid blocking the browser.
ja: このため、今後追加される並行モード（現状ではまだデフォルトでは無効です）ではレンダー処理を細分化し、ブラウザをブロックしてしまうことを避けるために処理を中断、再開するようになります。

source: This means that React may invoke render phase lifecycles more than once before committing, or it may invoke them without committing at all (because of an error or a higher priority interruption).
ja: これは、React がコミットの前にレンダーフェーズのライフサイクルを複数回呼び出しうるということであり、（エラーや優先度の高い割り込みによって）コミットを行わずに呼び出しうるということを意味します。

source: Render phase lifecycles include the following class component methods:
ja: レンダーフェーズのライフサイクルには次のクラス型コンポーネントのメソッドが含まれます。

source: * `constructor` * `componentWillMount` (or `UNSAFE_componentWillMount`) * `componentWillReceiveProps` (or `UNSAFE_componentWillReceiveProps`) * `componentWillUpdate` (or `UNSAFE_componentWillUpdate`) * `getDerivedStateFromProps` * `shouldComponentUpdate` * `render` * `setState` updater functions (the first argument)
ja: * `constructor` * `componentWillMount` (or `UNSAFE_componentWillMount`) * `componentWillReceiveProps` (or `UNSAFE_componentWillReceiveProps`) * `componentWillUpdate` (or `UNSAFE_componentWillUpdate`) * `getDerivedStateFromProps` * `shouldComponentUpdate` * `render` * `setState` 更新関数（第 1 引数）

source: Because the above methods might be called more than once, it's important that they do not contain side-effects.
ja: 上記のメソッドは複数回呼ばれることがあるため、副作用を持たないようにすることが大切です。

source: Ignoring this rule can lead to a variety of problems, including memory leaks and invalid application state.
ja: このルールを破ると、メモリリークやアプリケーションの無効な状態など、多くの問題を引き起こしえます。

source: Unfortunately, it can be difficult to detect these problems as they can often be [non-deterministic](https://en.wikipedia.org/wiki/Deterministic_algorithm).
ja: 不幸にも、これらの問題はしばしば[非決定的な](https://en.wikipedia.org/wiki/Deterministic_algorithm)ため、検出が難しくなります。

source: Strict mode can't automatically detect side effects for you, but it can help you spot them by making them a little more deterministic.
ja: strict モードでは自動的には副作用を見つけてはくれませんが、それらの副作用をほんの少し決定的にすることによって特定できる助けになります。

source: This is done by intentionally double-invoking the following functions:
ja: これは、以下の関数を意図的に 2 回呼び出すことによって行われます。

source: * Class component `constructor`, `render`, and `shouldComponentUpdate` methods * Class component static `getDerivedStateFromProps` method * Function component bodies * State updater functions (the first argument to `setState`) * Functions passed to `useState`, `useMemo`, or `useReducer`
ja: * クラスコンポーネントの `constructor`, `render`, `shouldComponentUpdate` メソッド * クラスコンポーネントの `getDerivedStateFromProps` 静的メソッド * 関数コンポーネントの本体 * state 更新用関数（`setState` の第 1 引数として渡されるもの） * `useState`, `useMemo`, `useReducer` に渡される関数

source: > Note: > > This only applies to development mode.
ja: > 補足： > > この機能は開発モードのみで適用されます。

source: _Lifecycles will not be double-invoked in production mode._
ja: _ライフサイクルは本番モードでは 2 回呼び出されることはありません。_

source: For example, consider the following code: `embed:strict-mode/side-effects-in-constructor.js`
ja: 例えば、次のようなコードを考えてみましょう。`embed:strict-mode/side-effects-in-constructor.js`

source: At first glance, this code might not seem problematic.
ja: はじめ見たとき、このコードには問題があるようには見えないかもしれません。

source: But if `SharedApplicationState.recordEvent` is not [idempotent](https://en.wikipedia.org/wiki/Idempotence#Computer_science_meaning), then instantiating this component multiple times could lead to invalid application state.
ja: しかし、`SharedApplicationState.recordEvent` が[冪等](https://en.wikipedia.org/wiki/Idempotence#Computer_science_meaning)ではないとすると、このコンポーネントを複数回インスタンス化するとアプリケーションの無効な状態を引き起こしえます。

source: This sort of subtle bug might not manifest during development, or it might do so inconsistently and so be overlooked.
ja: このような分かりづらいバグは開発中には現れないかもしれませんし、バグが一貫性のない挙動をして見逃してしまうかもしれません。

source: By intentionally double-invoking methods like the component constructor, strict mode makes patterns like this easier to spot.
ja: コンポーネントのコンストラクタなどのメソッドを意図的に 2 度呼び出すことによって、strict モードではこのようなことが起きた場合に気付きやすくしています。

source: > Note: > > Starting with React 17, React automatically modifies the console methods like `console.log()` to silence the logs in the second call to lifecycle functions.
ja: > 補足 > > React 17 以降で、React は `console.log()` のようなコンソールメソッドを自動的に変更し、ライフサイクル関数の 2 回目のコールでログが表示されないようにします。

source: However, it may cause undesired behavior in certain cases where [a workaround can be used](https://github.com/facebook/react/issues/20090#issuecomment-715927125).
ja: これにより特定のケースで意図しない動作を引き起こすことがありますが、[回避策も存在します](https://github.com/facebook/react/issues/20090#issuecomment-715927125)。

source: ### Detecting legacy context API {#detecting-legacy-context-api}
ja: ### レガシーなコンテクスト API の検出 {#detecting-legacy-context-api}

source: The legacy context API is error-prone, and will be removed in a future major version.
ja: レガシーなコンテクスト API はエラーを起こしがちで、将来のメジャーバージョンで削除予定です。

source: It still works for all 16.x releases but will show this warning message in strict mode:
ja: 16.x の全てのバージョンでは依然として動きますが、strict モードでは下のような警告文が表示されます。

source: Read the [new context API documentation](/docs/context.html) to help migrate to the new version.
ja: 新バージョンへの移行にあたっては[新コンテクスト API のドキュメント](/docs/context.html)を参考にしてください。
